{
    "intents":[
        {
            "greetings":{
                "patterns":["Hi","Hello","hey, whats up!","Hey how you doing","HI chatbot","Hi whats you name","Hello! what is your name?","Is there any name by which people call you?","Good morning","Good evening","Heyaaa","Hola","Guten Tag","Namaste","Hi buddy","Helloooo","what's up man","hey computer","hi boy",
                "Hi! What is your name?","Hey what do people call you?","Introduce yourself","Who created you?","Hello, who is your creator","who made you","who are the people that made you?","Marhaba","Namaskar","Ni hao","Bonjour","Yasou","Salve","konnichiwa","Assalamo aleikum"],
                "responses":["Hello!","Hi! I hope you are in a good health!","Namaste! How may I help you","I am doing good! How may I help you?","My name is InBOT! I am the Induction BOT","People call me InBOT","I am known as InBOT, the Induction Bot",
                "My creators are VIT engineers Ritika, Mrudual, Dishant, and Parth","Dishant, Parth, Mrudula, and Ritika have created me!","Do you know Dishant, Ritika, Mrudula, and Parth? These VIT engineers have designed and created me!"
            ,"I'm not getting this! I'm so sorry! Please try asking in some other manner."]
            },
            "overview":{
                "patterns":["Give an overview about the college","How is the college","Tell something about Vidyalankar Institute of Technology","Give basic information about VIT","How are the college placements","does VIT have on-campus college placements","are college placements","highest package offered in college placements","packages offered in placements",
                    "When was our college founded","Who is the founder of our college","Who is the founder of VIT","Who founded VIT","who laid college's foundation stone",
                "what is the basic objective of starting this institute","objective of laying institutes's foundation","thought behind starting this Vidyalankar Institute of Technology","idea behind VIT","Ideas behind starting this college",
            "what is the vision of the college","what are the values embibed by the college","vision behind starting VIT","college's missions","Mission of the college","who is the college's mascot",
            "what is VIT's mascot","mascot of Vidyalankar Institute of Technology","quality policies followed by the institute","policies which VIT follows","quality policies which are followed by Vidyalankar Institute of Technology",
        "where is the campus located","what is the address of the college","where is location of Vidyalankar Institute of Technology","where is VIT located","how to reach the college campus","how can VIT be reached","how to travel to the college","various travel routes to the college campus","nearby landmarks close to college","neighbourhood landmarks around Vidyalankar Institute of TEchnology",
    "neighboring buildings and landmarks near the college campus","Check the website for Placements related information."],
                "responses":["Vidyalankar Institute of Technology was established in the year 1999 after having secured permission from AICTE and Mumbai University. It was founded by Prof. C. S.Deshpande whose illustrious educational careen and missionary zeal continue to inspire everyone.",
                "The basic objective of starting this institute was to satisfy the inner urge of the founder to guide eager younger minds in appropriate direction and immbibe nobler values of life, thereby enhancing their worthiness.",
            "The Vision of Vidyalankar Institute of Technology is to become a globally recognized institute where learners are nurtured in a scholarly environment to evolve into competent professionals and researches to benefit the society. The Mission of Vidyalankar Institute of Technology is to evole a curriculum which emphasizes on strong fundamentals with the flexibility to choose advanced courses of interest and gain exposure to tools and techniques in contemporary subjects. The Values that the institute imparts are namely Honesty, Responsibility, Integrity, Committment, Excellence, and Salubrious Attitude.",
        "The Mascot of Vidyalankar Institue of Technology is a Bull, which denotes strength, power, force, and the ability to move ahead with determination.",
    "Address: Vidyalankar Institute of Technology,\n Vidyalankar Educational Campus,\n Vidyalankar College Marg,\n Wadala (E), Mumbai - 400 037,\n Maharashtra, India \n Telefax: 022 2416 11 26 \n The campus is located in Wadala (East), a central suburb of Mumbai, and stretches over 11 acres of land. It is close to residential complexes namely, Dosti Acres and Lloyd's Estate.",
    "Address: Vidyalankar Institute of Technology,\n Vidyalankar Educational Campus,\n Vidyalankar College Marg,\n Wadala (E), Mumbai - 400 037,\n Maharashtra, India \n Telefax: 022 2416 11 26 \n The campus is located in Wadala (East), a central suburb of Mumbai, and stretches over 11 acres of land. The landmarks and neighbourhood near the college include residential complexes namely, Dosti Acres and Lloyd's Estate.","I'm not getting this! I'm so sorry! Please try asking in some other manner."
]
            },
            "conduct":{
                "patterns":["What is Vidyalankar Institute of Technology's dress code","what is VIT's dress code","is there any uniform in the college","what to wear in the college","whhat to wear in the campus",
                    "what dress code is to be followed in the college campus","is there any fixed uniform to be weared in the college campus","which clothes to put on when in campus","measures taken to prevent ragging on campus",
                    "is the college subject to ragging","are students ragging safe in Vidyalankar Institute of Technology","are students ragged in VIT","does college prevent ragging","anti-ragging initiatives taken by the college"],
                "responses":["The dress code in the institute should be proper and appropriate. There is no such system of wearing a particular college uniform but a professional appearance is appreciated. Every Monday & Thursday - formal wear is encouraged",
                "Ragging is strictly prohibited and is a punishable offence as per the provisions of Government of Maharashtra as well as AICTE and UGC. If any student is found guilty of or abetting the ragging, strict disciplinary action shall be initiated and the student shall be penalized as per the provisions. THe Anti-Ragging Committee is responsible for administering the discipline system on the campus.","I'm not getting this! I'm so sorry! Please try asking in some other manner."
            ]
            },
            "academics":{
                "patterns":["academic programmes offered by the college","what are the programs offered to students in Engineering","whic different streams are available in the college","what are the different subject branches offered by VIT"
                ,"Vidyalankar Institute of Technology offers which courses to the engineering students","various courses offered to students in the college","various under graduate engineering programmes in the college","various post graduate engineering programmes in the college","undergraduate engineering streams",
            "post graduate engineering streams","what is VIT admission process","what is college's admission procedure","how to get admission in Vidyalankar Institute of Technology","procedure to enrollin VIT","enrollment process in the college","what are the institue timings","when does the college start in the morning",
        "moring college timings","at what time does the college begin","when does the college open","office timings of the college","what are the VIT office opening timings","what is the attendance requirement","how much attendace is mandatory in the college",
    "what are the attendace requirements by the college","how to apply for new ID card if old one is lost","how to get new identity card if previous card got misplaced","how much does new ID card cost","how much money to pay for new identity card"],
                "responses":["Following are the offered Programs / Streams / Branches: Undergraduate First year Engineering (FE) \n Undergraduate Direct Second Year (DSY) \n Postgraduate  Masters of Engineering (ME) \n Postgraduate  Masters of Management Studies \n Doctorate PhD in Technology",
                "Following are the offered Undergraduate Programs / Streams / Branches: Information Technology (INFT) \n Computer Engineering (CMPN) \n Electronics Engineering (ETRX) \n Electronics and Telecommunication Engineering (EXTC) \n Bio-Medical Engineering (BIOM) ",
                "Following are the offered Under Graduate Programs / Streams / Branches: Information Technology (INFT) \n Computer Engineering (CMPN) \n Electronics Engineering (ETRX) \n Electronics and Telecommunication Engineering (EXTC) \n Bio-Medical Engineering (BIOM) ",
            "Following are the offered Post Graduate Programs / Streams / Branches: Information Technology (INFT) \n Computer Engineering (CMPN) \n Electronics and Telecommunication Engineering (EXTC) ","The Institute follows eligibility criteria as specified by the Directorate of Technical Education,Maharashtra State. For more information regarding admission or enrollment procedure refer https://www.mahacet.org/",
        "The Institute Timings are as follows:\n College Timings: 8:00am to 4:00pm (First Shift), 11:15am to 6:45pm (Second Shift)\n Office Timings:\n A-Block Vice Principal's Office 10:30am to 11:15am (Monday to Friday)\n A-Block Registrar's Office 3:00 to 5:30pm (Monday to Friday), 10:00am to 4:00pm (Saturday)\n B Block Exam Cell 1:15pm to 1:45pm (Monday to Friday)\n M Block Training & Placement 1:15pm to 1:45pm (Monday to Friday)\n Library Timings: 9:00am to 5:00pm\n Reading Hall Timings:8:00am to 8:00pm\n Computer Centre: 9:00am to 8:00pm\n Stationary: 10:00am to 5:00pm\n Cafeteria: 8:00am to 7:00pm"
    ,"Report lost or damaged identity card to the Institute Authorities without any delay and follow the procedure to get a new ID Card. Replacement card shall be issued on submission of application in a prescribed format along with fees of Rs. 300.00."
,"As per the rules and regulations of the University of Mumbai, it is necessary for every student to attend atleast 75% of lectures and practicals of every subject. Student attendance is monitored by the respective department.","Examinations are conducted by the University at the end of each semester. The requisite exam fee will be paid at the Institute, prior to every semester examination. Please visit www.mu.ac.in for more details. Students may contact the Examination Cell for more details","I'm not getting this! I'm so sorry! Please try asking in some other manner."
]
            },
            "resources":{
                "patterns":["is there any lecture capture facility","what if someone misses the classes","are the lectures recorded","where do professors put there lectures","is there any study room","quiet place for studying in the college"
                ,"does college campus have a facility to refer books or textbooks","is there a library to go and study","what are the library norms","what are the college library rules","are there any rules or protocols to issue books","what are the practical learning facilities in the college",
            "are there computer labs to perform practicals in the college","where do students perform computer practicals","are there any digital laboratory facilities in the campus","how many computer labs in the campus","software developemtn facilities",
        "technical literacy facilities for computer engineering","what are the internet facilitites in college campus","networking facilities in the campus","wifi requirements","free wifi connection for students","high speed net facilities","email ids for students",
    "are students provided with personal email ids","is there any email id providied by the college","what is the email id given by the college","student management softwares used by VIT","is there any student performance reviewing software","where to find student personal academic details","where can we find previous fee pay and academic information",
"how to download old fee receipts","is there any student profile maintenance software","how can one request for student bonafide certificate","how to apply for railway concession pass for a student","does college rpovide railway travelling pass facility","how to digitally enroll for examination",
"does college have online exam enrollment","how to apply for exams online","are parents contacted by the college", "how is contacting achieved between parents students and college","do parents receive notifications from the college","is there any messaging or sms facility",
"what are the cafeteria facilities in the college campus","any canteen or cafe in VIT","canteen facility for ohu students in the campus","are there any coffee cafes in the campus","what cafeteria and food services are provided by the college",
"what are the different souveniers available for vit students","does the campus have any photography or stationary service","where can students buy necessary stationary requirements","are there hostels provided by the college","where is the Vidyalnakar Institute of Technology hostel located",
"does college have any hostel or paying guest facility available","different amenities available for physically challenged students","does vit provide special services to physically impaired students","are there necessary helplines for physcally challenged",
"important telephone numbers for student assistance","where to contact if students need assistance","are there any helplines for student assistance","are there first aid facilities in the campus","is there any medical assistance in case of emergency",
"what medical facilities does vit have","are there any measures in case of emergency","what is VPrint","is there any printing facility in the college","how to take printouts in the campus","print printing printout online"],
                "responses":["The institute provides students with the Lecture Capture System which is a comprehensive e - learning solution. The core feature is automatic recording and distribution of classroom lectures. This enables the students to re-live their their classroom experience.",
                "The institute library is one of the key learning resources which assists students in fulfilling their information requirements in a comfortable study space. The Reading room houses all books for reference work. Institute campus library has 30650 books consisting of engineering and management subjects, technical journals, periodicals.",
            "Library Norms / Rules are as follows:\nUG and PG students will be issued 5 books for 45 days as per availability.\nLibrary hours are: 9:00am to 5:00pm.\nReading Hall hours are: 8:00am to 8:00pm.\n Late fees of Rs. 5.00 per book per day for delay in returning.",
        "Institute has a Computer Centre which gives open access to students for their needs. Apart from IBM compatible Pentium 4 computers, Computer Centre also houses Apple Desktops. hence the practical learning needs are properly taken care.",
    "The Institute provides Internet Wifi serivces in the campus, to the students as well as the professors.","Students are issued email id firstname.lastname@vit.edu.in on Institute server for academic use.",
"ERP (Enterprise Resource Planning) is a software aimed at bringing in process refinement, efficiency, accountability and control in the college. Apart from managing the administrative, financial and academic functions of the institution, it is also a platform for sharing information between all stakeholders, viz. Students, Parents, Teachers, Administrators, Management, Corporate and the Alumni.",
"The roles played by ERP are as follows:\n Transparency in administration at all levels.\nAccountability in the system.\n Improvement in the quality of education management system.\nProfile Maintenance.\n Exam Enrollment.\n Check availability of books in the library.\nRequest for Bonafide Certificate.\n Class Time-table available",
"Students/Parents who have submitted their cellphone numbers can get message alerts from the Institute informing them about important schedules and announcements.",
"The Institute Cafeteria offers an extensive menu comprising a variety of sumptous South Indian, North Indian, Chinese and Continental food in a comfortable eating environment. The Cafe Coffee Day corner offers grab - n - go items such as sandwiches, puffs, soups noodles, cold coffees and hot teas. Utmost care is taken to maintain cleanliness. Canteen Timings, Open: Monday to Saturday 8:00am to 7:00pm",
"Students can purchase VIT souveniers of their interests for personal use or for gifting. Many articles like T-Shirts, Caps, Mugs, Pens, Watches, Wallets, etc. emblazoned with the VIT logo are available in this outlet.",
"VIT has a stationary outlet managed under contract where various stationary items are available. Pricing is reviewed and approved by the Institute authority. Students can also avail photocopying facility here.",
"Vidyalankar Gurukul, a hostel for boys at Nerul, Navi Mumbai, is managed by Vidyalankar. It is located within a walking distance from Nerul Railway Station . The hostel also fulfills internet and computer requirements.",
"Institute has a sick room available for students and staff members","The Institute has a sick room for medical assistance during any emergency. First Aid boxes are available at Main Security Cabin, Gymkhana, Main Office. There is also an Ambulance Facility on campus.","VIT is equipped with rest room for physically challenged students. There is a specially marked parking space too. A ramp is fitted alongside the staricase at the entry. In addition to elevators, there is a stair climber too.",
"Important Telephone Numbers for Student Assistance:\n Security Officer: 9100/9101 from campus phone located in Telephone booth.\n Fire: 101.\n Police: 100.\n Hospitals: KEM Hospital-022 2413 60 51, Sion Hospital-022 2407 63 84/5.\n Ambulance: 1252.\n Principal: 1001 from Campus phone located in telephone booth.",
"If you happen to lose any articles or books or any personal thing, you can contact the Lost and Found office (F204) in the F block and attempt to retrieve them. Also, please deposit any articles you may find on the campus in the same office so that the righful owners can reclaim them.","I'm not getting this! I'm so sorry! Please try asking in some other manner.","The Institute has created a web - based centralized printing service that allows users to give print jobs from anywhere around the globe to Any Time Print (ATP) stations at the institute."
]
            },
            "activities":{
                "patterns":["what are the different activities conducted to make the college life eventful","what interesting events are organised in the college","are there any cultural or sports events conducted in the campus","how is the campus life at vit","what do college students do to make college life interesting",
                "what is the name of our annual fest","when is the college annual festival conducted in the college","are there any annual functions in the college","what is Friday Pathshaala all about","what is friday pathshala","what are the weekly functions or interesting events planned by the college",
            "are there any weekly events for students to enjoy","does VIT have its own magazine and newspaper publication","what is the name of VIT's newspaper","can students submit there articles in college magazine","what is the name of college magazine","does vidyalnakar have  any yearly publications for students to read",
        "what are the different student chapters in the college","are there any student clubs or committees in the campus","can students participate in technical clubs or committess in the college","how does the college provide exposure to students","are there any extra-curricular clubs or committess to participate","what is the meaning of corporate social responsibility",
    "what does corporate social responsibility mean","what does it mean to be corporate socially responsible"],
                "responses":["VIT has always encouraged students to give expressions to their talents and creativities by organising cultural and sports related activities in the college. The Student Council manages the activities under the guidance of the Conveners. The Institute has indoor as well as outdoor sports facilities with 2 playgrounds available in the campus.",
                "The Institute has indoor as well as outdoor sports facilities with 2 playgrounds available in the campus. The Sports Committee arranges tournaments with sports like carrom, chess, table tennis, football,volleyball, Kho-kho, cricket, kabbadi, arm wrestling, etc. Inter-collegiate S-6 cricket tournament is a major attraction which is held during February - March every year.",
            "Students experience many interesting events during their campus life here at Vidyalankar Institute of Technology. Our Annual Fest is known as 'Verve'","Verve, our Inter-College annual festival brings in the fervor, zeal, enthusiasm in the campus where real talent is highlighted. The Student Activity Centre offers a place for students to organise and plan activities at various levels.",
        "Friday Paathshaala is a weekly event everyone looks forward to with breathless anticipation every Friday between 4:30pm to 6:30pm in the amphitheatre.Dance, movie screenings, skits, rock shows and many more interesting events give them an opportunity to be free spirits on the campus.",
    "College publications include our own newsletter named 'Vector' and our annual magazine named 'V Express'. Vector has it's three objectives,\n enhancing the learning environment on campus,\n acquainting students with national and world level events, and \n encouraging a readership habit.",
    "College publications include our own newsletter named 'Vector' and our annual magazine named 'V Express'. V Express serves as an output for the literary creativity of the students of VIT. The editing staff consists of students from all courses.","Department Student Association:\n ITSA - Information Technology Students' Association \n CESA - Computer Engineering Students' Association \n EESA - Electronics Students' Association \n ETSA - Electronics and Telecommunications Students' Association \n BMSA - Bio-Medical Students' Association \n MMSSA - Master of Management Studies Students' Association.",
"Student Chapters: \n ACM - Association for Computer Machinery \n CSI - Computer Society of India \n IEEE - Institute of Electrical and Electronics Engineers \n IETE - Institute of Electronics and Telecommunication Engineering \n BMESI - Bio Medical Engineers' Society of India \n MMSPB - Master of Management Studies Professional Body \n ISTE -  Indian Society for Technical Education \n ","I'm not getting this! I'm so sorry! Please try asking in some other manner."
]
            },
            "goodbye":{
                "patterns":["Goodbye!","Good Bye!","Bye InBOT","Goodbye InBOT, it was nice talking to you","Bubye! Have a nice day","Bubye","See you later","Sayonara InBOT!","Au Revoir","AuRevoir","Ma'a as-salaama","Bidaya","Yasou","Khuda hafiz"],
                "responses":["Goodbye! Have a good day!","Namaste!","Have a good day ahead!","I'm not getting this! I'm so sorry! Please try asking in some other manner."
                ]
            }
        }
    ]
}